## Final Project Submission

Please fill out:
* Student name: PATIENCE ANONO
* Student pace: FULL TIME
* Scheduled project review date/time: 
* Instructor name: MARK TIBA
* Blog post URL:

1. INTRODUCTION<br>

In this project,Microsoft was launching a new movie studio and i had to make recommendations to the stake holders.
I had to find out what types of films are doing best in the current market at the moment and present the findings to the Microsoft executives.I used exploratory data analysis to generate insights for the business.To get started, I was given the following sets of data obtained from the following sources:
Box Office Mojo.
IMDB.
Rotten Tomatoes.
TheMovieDB.
The Numbers.

I was assigned with the following tasks:
Explore the given data and/or find complementary data
Obtain meaningful, actionable insights from it that will
Help the new head of the studio decide What type of films to create.

2. BUSINESS PROBLEM<br>

Microsoft sees all the big companies creating original video content and they want to get in on the fun. They have decided to create a new movie studio, but they don’t know anything about creating movies.After my survey,i found a lot of information on individual movies.There are countless factors at play in creating original video content for a movie studio, from determining production costs to developing targeted marketing campaigns.

2.1 Objectives<br>
As a consultant, i decided to focus my analysis on:
1.High level recommendation on genres because once the studio understood what sort of films they wanted to make,they would make better decisons.
2.The most lucrative time to release the movies.
3.The production budget to achieve the highest likely returns on investment.
4.The type of films  that are currently doing the best at the box office.
5.What  people like.
6.How much does it costs to make each type of movie.
8.How much money they are making.

3. DATA UNDERSTANDING<br>
With a seemingly endless array of movies and television shows for users to choose from, retaining viewers is of paramount importance to streaming services and film production companies.If viewer recommendations are not accurate,this could lead to that viewer turning to watch other things.

4. DATA PREPARATION<br>
I utilized different sources for my analysis such as Inspecting all of the data sets provided using python and pandas library, storing and cleaning the data in a pandas dataframe and visualization of data using seaborn and matplotlib.Idecided to focus more on the genre and finances.

4.1 LOADING DATA INTO OUR JUPYTER NOTEBOOK<br>
 Importing required Libraries

In [8]:
# importing the necessary packages to use for this project
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from bs4 import BeautifulSoup
import requests
import csv
import sqlite3
%matplotlib inline

In [9]:
#moving into the folder to get the files
! ls

bom.movie_gross.csv.gz
im.db
im.db.zip
rt.movie_info.tsv.gz
rt.reviews.tsv.gz
tmdb.movies.csv.gz
tn.movie_budgets.csv.gz

In [12]:
cd zippedData

[WinError 2] The system cannot find the file specified: 'zippedData'
C:\Users\Patience\Documents\GitHub\project1\zippedData

In [11]:
! ls

bom.movie_gross.csv.gz
im.db
im.db.zip
rt.movie_info.tsv.gz
rt.reviews.tsv.gz
tmdb.movies.csv.gz
tn.movie_budgets.csv.gz

4.1.1 MOVIE INFO DATA
Reading the data files contained in the csv folder

In [13]:
# Load 'rt.movie_info.tsv.gz' as a DataFrame.The first 5 rows.
data = pd.read_table('rt.movie_info.tsv.gz', )
data.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

4.1.2 Accessing Data from the DataFrame

In [14]:
#lets put the read information into an assigned variable df and Get a concise summary of the data using .info()
data = pd.read_table('rt.movie_info.tsv.gz')
data.info()                                 #Get a concise summary of the data using .info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [15]:
#Obtain a tuple representing the number of rows and number of columns
data.shape

(1560, 12)

In [16]:
#checking for null values in our dataFrame
data.isna().sum()

id                 0
synopsis          62
rating             3
genre              8
director         199
writer           449
theater_date     359
dvd_date         359
currency        1220
box_office      1220
runtime           30
studio          1066
dtype: int64

In [17]:
data.columns

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

4.1.3 Retrieving relevant Information.

In [18]:
relevant_features =  ['rating', 'genre', 'director','runtime', 'box_office']
relevant_features

['rating', 'genre', 'director', 'runtime', 'box_office']

4.1.4 Data Cleaning

In [19]:
#replacing the null with null string
for feature in relevant_features:
    data[feature] = data[feature].fillna('')

In [20]:
#combining all the relevant features
combined_features = data['rating']+' '+data['genre']+' '+data['director']+' '+data['runtime']+' '+data['box_office']
combined_features.head()

0    R Action and Adventure|Classics|Drama William ...
1    R Drama|Science Fiction and Fantasy David Cron...
2    R Drama|Musical and Performing Arts Allison An...
3    R Drama|Mystery and Suspense Barry Levinson 12...
4         NR Drama|Romance Rodney Bennett 200 minutes
dtype: object

In [89]:
#Check for duplicates
data.duplicated().value_counts()

False    1560
dtype: int64

DATA ANALYSIS

In [17]:
#the average rating for each director
data.columns

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

In [90]:
# getting counts for each value in genre column
data['genre'].value_counts()

Drama                                                                                     151
Comedy                                                                                    110
Comedy|Drama                                                                               80
Drama|Mystery and Suspense                                                                 67
Art House and International|Drama                                                          62
                                                                                         ...
Art House and International|Drama|Sports and Fitness                                        1
Comedy|Documentary|Musical and Performing Arts|Special Interest                             1
Comedy|Cult Movies|Mystery and Suspense|Science Fiction and Fantasy                         1
Action and Adventure|Art House and International|Mystery and Suspense|Special Interest      1
Comedy|Drama|Kids and Family|Sports and Fitness                                             1
Name: genre, Length: 300, dtype: int64

In [91]:
# getting counts for each value in rating column
data['rating'].value_counts()

R        521
NR       503
PG       240
PG-13    235
G         57
           3
NC17       1
Name: rating, dtype: int64

In [24]:
# generating descriptive statistics for box office
data['box_office'].describe()

count         340
unique        336
top       600,000
freq            2
Name: box_office, dtype: object

In [21]:
# generating descriptive statistics for production budget values
data['currency'].describe()

count     340
unique      1
top         $
freq      340
Name: currency, dtype: object

In [94]:
data.columns

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

In [93]:
#Director with the most ratings
data.groupby('director')['rating'].max()

director
Abel Ferrara                        R
Adam Ravetch|Sarah Robertson        G
Adam Shankman                      PG
Adam Silver|Ben Hayflick        PG-13
Aditya Chopra                      NR
                                ...
Youssef Delara                  PG-13
Yves Simoneau                       R
Zak Penn                            R
Zeresenay Berhane Mehari           NR
Zhang Jun Zhao                     NR
Name: rating, Length: 1125, dtype: object

MOVIES

In [ ]:
#Reading the csv file with movies
data_movies = pd.read_csv('tmdb.movies.csv.gz')
data_movies.head() #first 5 rows

In [83]:
#dropping the 'Unnamed' column as its unnecessary
data_movies = data_movies.drop(columns='Unnamed: 0')
data_movies

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...
26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

In [78]:
# getting info for DataFrame
data_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   genre_ids          26517 non-null  object
 1   id                 26517 non-null  object
 2   original_language  26517 non-null  object
 3   original_title     26517 non-null  object
 4   popularity         26517 non-null  object
 5   release_date       26517 non-null  object
 6   title              26517 non-null  object
 7   vote_average       26517 non-null  object
 8   vote_count         26517 non-null  object
dtypes: object(9)
memory usage: 1.8+ MB

In [79]:
#number of rows and colums in my data frame
data_movies.shape

(26517, 9)

In [46]:
#selecting the relevant features for recommendation.
selected_features = ['popularity', 'release_date', 'vote_count']
selected_features

['popularity', 'release_date', 'vote_count']

In [56]:
#combining all the relevant features from this dataFrame
combined_data = data_movies['popularity']+' '+data_movies['release_date']+' '+data_movies['vote_count']
combined_data

0        33.533 2010-11-19 10788
1         28.734 2010-03-26 7610
2        28.515 2010-05-07 12368
3        28.005 1995-11-22 10174
4         27.92 2010-07-16 22186
                  ...
26512           0.6 2018-10-13 1
26513           0.6 2018-05-01 1
26514           0.6 2018-10-01 1
26515           0.6 2018-06-22 1
26516           0.6 2018-10-05 1
Length: 26517, dtype: object

In [57]:
# convert release date column to datetime values
data_movies['release_date'] = pd.to_datetime(data_movies['release_date'])
# create release month column
data_movies['release_month'] = data_movies['release_date'].dt.strftime('%B')

In [58]:
# checking for successful column creation
data_movies['release_month'].value_counts()

January      3132
October      3035
April        2566
March        2406
November     2338
September    2264
June         2166
December     1929
May          1865
August       1698
February     1614
July         1504
Name: release_month, dtype: int64

In [59]:
data_movies.isna().sum()

Unnamed: 0           0
genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
release_month        0
dtype: int64

In [109]:
#Check for duplicates
data_movies.duplicated().value_counts()

False    26517
dtype: int64

MOVIE_GROSS TABLE

In [104]:
# Use pandas to load the csv file
movie_gross = pd.read_csv('bom.movie_gross.csv.gz')
movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [62]:
movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [63]:
#missing values in each column
movie_gross.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [66]:
#missing values in percentage.Create a variable
per_missing = movie_gross.isna().sum() * 100/len(movie_gross)
per_missing

title              0.000000
studio             0.147623
domestic_gross     0.826690
foreign_gross     39.858282
year               0.000000
dtype: float64

In [67]:
#Drop all the missing values
movie_gross.dropna(axis=0)

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3275,I Still See You,LGF,1400.0,1500000,2018
3286,The Catcher Was a Spy,IFC,725000.0,229000,2018
3309,Time Freak,Grindstone,10000.0,256000,2018
3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200,2018
3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000,2018

In [69]:
#Check for duplicate data
movie_gross.duplicated().value_counts()

False    3387
dtype: int64

In [72]:
#overall statistics about our data frame
movie_gross.describe(include = 'all')

            title studio  domestic_gross foreign_gross         year
count        3387   3382    3.359000e+03          2037  3387.000000
unique       3386    257             NaN          1204          NaN
top     Bluebeard    IFC             NaN       1200000          NaN
freq            2    166             NaN            23          NaN
mean          NaN    NaN    2.874585e+07           NaN  2013.958075
std           NaN    NaN    6.698250e+07           NaN     2.478141
min           NaN    NaN    1.000000e+02           NaN  2010.000000
25%           NaN    NaN    1.200000e+05           NaN  2012.000000
50%           NaN    NaN    1.400000e+06           NaN  2014.000000
75%           NaN    NaN    2.790000e+07           NaN  2016.000000
max           NaN    NaN    9.367000e+08           NaN  2018.000000

The year that had the most average domestic gross

In [73]:
movie_gross.columns

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [81]:
#in descending order
movie_gross.groupby('year')['domestic_gross'].mean().sort_values(ascending=False)

year
2018    3.601042e+07
2017    3.416646e+07
2010    3.144559e+07
2013    3.128212e+07
2012    2.767584e+07
2014    2.643923e+07
2016    2.598996e+07
2011    2.535052e+07
2015    2.461338e+07
Name: domestic_gross, dtype: float64

MOVIE BUDGETS TABLE

In [67]:
movie_budget = pd.read_csv('tn.movie_budgets.csv.gz')
movie_budget.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [90]:
#info summary about the data Frame
movie_budget.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [91]:
#checking for misssing values in the Data
movie_budget.isna().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

Opening a connection to the database

In [55]:
conn = sqlite3.connect('im.db')
df = pd.read_sql("""SELECT * FROM principals ;""", conn)
df.head()

    movie_id  ordering  person_id  category       job        characters
0  tt0111414         1  nm0246005     actor      None       ["The Man"]
1  tt0111414         2  nm0398271  director      None              None
2  tt0111414         3  nm3739909  producer  producer              None
3  tt0323808        10  nm0059247    editor      None              None
4  tt0323808         1  nm3579312   actress      None  ["Beth Boothby"]

JOINING TABLES

In [61]:
q = """
SELECT person_id 
FROM principals
JOIN persons
    USING(person_id)
;
"""
df = pd.read_sql(q, conn)
df.head()

   person_id
0  nm0246005
1  nm0398271
2  nm3739909
3  nm0059247
4  nm3579312

In [63]:
x = """
SELECT movie_id
FROM principals
JOIN movie_basics
    USING(movie_id)
;
"""
df1 = pd.read_sql(x, conn)
df1.head()

    movie_id
0  tt0111414
1  tt0111414
2  tt0111414
3  tt0323808
4  tt0323808

In [65]:
y = """
SELECT movie_id, original_title, is_original_title
FROM movie_akas
JOIN movie_basics
    USING(movie_id)
;
"""
df2 = pd.read_sql(y, conn)
df2.head()

    movie_id  original_title  is_original_title
0  tt0369610  Jurassic World                0.0
1  tt0369610  Jurassic World                0.0
2  tt0369610  Jurassic World                0.0
3  tt0369610  Jurassic World                0.0
4  tt0369610  Jurassic World                0.0

VISUALIZATION

In [ ]:
data['runtime'].describe()

In [ ]:
plt.hist(data['runtime'],range=(110,120),bins = 20)
plt.title('Movie runtimes', fontsize = 20)
plt.xlabel('Minutes', fontsize = 15  )
plt.ylabel('Number of Movies', fontsize = 15)
plt.xticks(rotation=-90)
plt.show()

In [ ]:
movie_gross.plot.bar()
plot.xticks(rotation=45, horizontalalignment="center")
plot.title("Domestic Gross and years")
plot.xlabel("year")
plot.ylabel("domestic_gross")

In [ ]:
data_movies['popularity'].plot(kind="bar")
plot.title("Death rate of corona virus")
plot.xlabel("release_date")
plot.ylabel("popularity")